# PANDAS

In [1]:
import pandas as pd

# PANDA SERIES

In [2]:
# create a list
l1 = [1,2,3,4,5]

labels= ["a","b","c","d","e"]

In [3]:
print(l1)
print()
print(labels)

[1, 2, 3, 4, 5]

['a', 'b', 'c', 'd', 'e']

In [4]:
s1= pd.Series(data = l1)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
s2 = pd.Series(data = l1, index = labels)
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
print(type(l1))
print(type(s1))

<class 'list'>
<class 'pandas.core.series.Series'>

In [7]:
# create a tuple
t = (1,2,3,4,5)
t

(1, 2, 3, 4, 5)

In [8]:
s3 = pd.Series(t)
s3

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
print(type(t))
print(type(s3))

<class 'tuple'>
<class 'pandas.core.series.Series'>

In [10]:
#create series using dictionary

d1  = {'A': 100 ,'B': 200, 'C': 300, 'D': 400}
s4 = pd.Series(d1)
print(d1)
print("----------")
print(s4)
print("----------")
print(type(d1))
print(type(s4))

{'A': 100, 'B': 200, 'C': 300, 'D': 400}
----------
A    100
B    200
C    300
D    400
dtype: int64
----------
<class 'dict'>
<class 'pandas.core.series.Series'>

# DATA FRAME

## CREATE DATAFRAME
### using list of list to create dataframe

In [11]:
l2 = [[1,2,3],[4,5,6,],[7,8,9]]
# nested list
row_names  = ['A','B','C']
col_names  = ['x',"y","z"]
print(l2)
print()
print(row_names)
print()
print(col_names)

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

['A', 'B', 'C']

['x', 'y', 'z']

In [12]:
df = pd.DataFrame(data = l2, index = row_names, columns = col_names)
df

   x  y  z
A  1  2  3
B  4  5  6
C  7  8  9

In [13]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [14]:
d2  ={'Names': ['Chirag','Adesh','Mahesh','Rajesh'],'Education':['BE','Mtech','MSc','Btech'] , 
      'Address' :['Bangalore','Pune','Chennai','Mumbai'], 'Percentage' :[80, 90,60,75]}
d2

{'Names': ['Chirag', 'Adesh', 'Mahesh', 'Rajesh'],
 'Education': ['BE', 'Mtech', 'MSc', 'Btech'],
 'Address': ['Bangalore', 'Pune', 'Chennai', 'Mumbai'],
 'Percentage': [80, 90, 60, 75]}

In [15]:
df1 = pd.DataFrame(data = d2, index = ["r1","r2","r3","r4"])
df1

     Names Education    Address  Percentage
r1  Chirag        BE  Bangalore          80
r2   Adesh     Mtech       Pune          90
r3  Mahesh       MSc    Chennai          60
r4  Rajesh     Btech     Mumbai          75

# DATA ACCESSIBILITY

- dot operator
- [] operator
- [[]] operator

In [16]:
df1.Names

r1    Chirag
r2     Adesh
r3    Mahesh
r4    Rajesh
Name: Names, dtype: object

In [17]:
df1["Names"]

r1    Chirag
r2     Adesh
r3    Mahesh
r4    Rajesh
Name: Names, dtype: object

In [18]:
df1[["Names"]]

     Names
r1  Chirag
r2   Adesh
r3  Mahesh
r4  Rajesh

In [19]:
df1[["Names","Education","Percentage"]]["r1":"r3"]

     Names Education  Percentage
r1  Chirag        BE          80
r2   Adesh     Mtech          90
r3  Mahesh       MSc          60

# LOC and ILOC

In [20]:
# LOC and ILOC
# LOC is used for label based accessing of the data
# ILOC is used for integer based accessing of the data

In [21]:
df1.loc["r1":"r3", "Names":"Percentage"]

     Names Education    Address  Percentage
r1  Chirag        BE  Bangalore          80
r2   Adesh     Mtech       Pune          90
r3  Mahesh       MSc    Chennai          60

In [22]:
df1.loc[["r1","r3"], ["Names","Percentage"]]

     Names  Percentage
r1  Chirag          80
r3  Mahesh          60

In [23]:
df1.iloc[0:2, 1:3]

   Education    Address
r1        BE  Bangalore
r2     Mtech       Pune

# adding new values to existing table

In [24]:
df1["Branch"] = ['Civil', 'CSE' ,'ISE', 'BIOTech']

In [25]:
df1

     Names Education    Address  Percentage   Branch
r1  Chirag        BE  Bangalore          80    Civil
r2   Adesh     Mtech       Pune          90      CSE
r3  Mahesh       MSc    Chennai          60      ISE
r4  Rajesh     Btech     Mumbai          75  BIOTech

In [26]:
df1["College"]= "xyz"

In [27]:
df1

     Names Education    Address  Percentage   Branch College
r1  Chirag        BE  Bangalore          80    Civil     xyz
r2   Adesh     Mtech       Pune          90      CSE     xyz
r3  Mahesh       MSc    Chennai          60      ISE     xyz
r4  Rajesh     Btech     Mumbai          75  BIOTech     xyz

In [28]:
# adding multiple data together

In [29]:
df1["Internal_marks"], df1["Specialization"] =  [20, 25, 22, 18] , ['structures', 'cyber', 'database', 'Ml']

In [30]:
df1

,Names,Education,Address,Percentage,Branch,College,Internal_marks,Specialization
r1,Chirag,BE,Bangalore,80,Civil,xyz,20,structures
r2,Adesh,Mtech,Pune,90,CSE,xyz,25,cyber
r3,Mahesh,MSc,Chennai,60,ISE,xyz,22,database
r4,Rajesh,Btech,Mumbai,75,BIOTech,xyz,18,Ml

#  DELETE COLUMNS

# Drop

In [31]:
df1.drop(labels = ["Internal_marks"], axis = 1)

     Names Education    Address  Percentage   Branch College Specialization
r1  Chirag        BE  Bangalore          80    Civil     xyz     structures
r2   Adesh     Mtech       Pune          90      CSE     xyz          cyber
r3  Mahesh       MSc    Chennai          60      ISE     xyz       database
r4  Rajesh     Btech     Mumbai          75  BIOTech     xyz             Ml

In [32]:
df1.drop(labels = ["Internal_marks"], axis = 1, inplace = True)

In [33]:
df1

     Names Education    Address  Percentage   Branch College Specialization
r1  Chirag        BE  Bangalore          80    Civil     xyz     structures
r2   Adesh     Mtech       Pune          90      CSE     xyz          cyber
r3  Mahesh       MSc    Chennai          60      ISE     xyz       database
r4  Rajesh     Btech     Mumbai          75  BIOTech     xyz             Ml

In [34]:
# delete data row wise

# Renaming the column Name

In [35]:
df1.rename({"Education":"Edu"}, axis = 1)

     Names    Edu    Address  Percentage   Branch College Specialization
r1  Chirag     BE  Bangalore          80    Civil     xyz     structures
r2   Adesh  Mtech       Pune          90      CSE     xyz          cyber
r3  Mahesh    MSc    Chennai          60      ISE     xyz       database
r4  Rajesh  Btech     Mumbai          75  BIOTech     xyz             Ml

In [36]:
df1

     Names Education    Address  Percentage   Branch College Specialization
r1  Chirag        BE  Bangalore          80    Civil     xyz     structures
r2   Adesh     Mtech       Pune          90      CSE     xyz          cyber
r3  Mahesh       MSc    Chennai          60      ISE     xyz       database
r4  Rajesh     Btech     Mumbai          75  BIOTech     xyz             Ml

# MISSING VALUE IMPUTATION

In [37]:
import numpy as np

In [38]:
df1["Internal_Marks"] = [23,28, np.NaN, 18]

In [39]:
df1

,Names,Education,Address,Percentage,Branch,College,Specialization,Internal_Marks
r1,Chirag,BE,Bangalore,80,Civil,xyz,structures,23.0
r2,Adesh,Mtech,Pune,90,CSE,xyz,cyber,28.0
r3,Mahesh,MSc,Chennai,60,ISE,xyz,database,NaN
r4,Rajesh,Btech,Mumbai,75,BIOTech,xyz,Ml,18.0

- mean imputation # fillna is the function for filling the missing values using mean, mode or median

In [40]:
df1[["Internal_Marks"]].fillna(df1.Internal_Marks.mean())

    Internal_Marks
r1            23.0
r2            28.0
r3            23.0
r4            18.0

In [41]:
df1["Internal_Marks"].fillna(df1.Internal_Marks.mode())

r1    23.0
r2    28.0
r3     NaN
r4    18.0
Name: Internal_Marks, dtype: float64

In [42]:
df1["Internal_Marks"].fillna(df1.Internal_Marks.median())

r1    23.0
r2    28.0
r3    23.0
r4    18.0
Name: Internal_Marks, dtype: float64

In [43]:
# FFIL and BFIL
# forwad fill and backward fill

In [44]:
df1.Internal_Marks.ffill()

r1    23.0
r2    28.0
r3    28.0
r4    18.0
Name: Internal_Marks, dtype: float64

In [45]:
df1.Internal_Marks.bfill()

r1    23.0
r2    28.0
r3    18.0
r4    18.0
Name: Internal_Marks, dtype: float64

# MAP and REPLACE

# Append function to add new data

In [46]:
d2  =  {'Names': 'Sohan', 'Education' :'BE', 'Address' :'vizag', 'Percentage': 80 , 'Internal_marks' : 20}

In [47]:
d2

{'Names': 'Sohan',
 'Education': 'BE',
 'Address': 'vizag',
 'Percentage': 80,
 'Internal_marks': 20}

In [48]:
df1.append(d2, ignore_index = True)

C:\Users\Apoorva\AppData\Local\Temp\ipykernel_26952\330279464.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(d2, ignore_index = True)

,Names,Education,Address,Percentage,Branch,College,Specialization,Internal_Marks,Internal_marks
0,Chirag,BE,Bangalore,80,Civil,xyz,structures,23.0,NaN
1,Adesh,Mtech,Pune,90,CSE,xyz,cyber,28.0,NaN
2,Mahesh,MSc,Chennai,60,ISE,xyz,database,NaN,NaN
3,Rajesh,Btech,Mumbai,75,BIOTech,xyz,Ml,18.0,NaN
4,Sohan,BE,vizag,80,NaN,NaN,NaN,NaN,20.0

# KNOW ABOUT OUR DATA

In [49]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, r1 to r4
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Names           4 non-null      object
 1   Education       4 non-null      object
 2   Address         4 non-null      object
 3   Percentage      4 non-null      int64
 4   Branch          4 non-null      object
 5   College         4 non-null      object
 6   Specialization  4 non-null      object
 7   Internal_Marks  3 non-null      float64
dtypes: float64(1), int64(1), object(6)
memory usage: 460.0+ bytes

In [50]:
df1.describe()

       Percentage  Internal_Marks
count        4.00             3.0
mean        76.25            23.0
std         12.50             5.0
min         60.00            18.0
25%         71.25            20.5
50%         77.50            23.0
75%         82.50            25.5
max         90.00            28.0

In [51]:
df1.describe(include = "O")

         Names Education    Address Branch College Specialization
count        4         4          4      4       4              4
unique       4         4          4      4       1              4
top     Chirag        BE  Bangalore  Civil     xyz     structures
freq         1         1          1      1       4              1

In [52]:
df1.dtypes

Names              object
Education          object
Address            object
Percentage          int64
Branch             object
College            object
Specialization     object
Internal_Marks    float64
dtype: object

In [53]:
df1.columns

Index(['Names', 'Education', 'Address', 'Percentage', 'Branch', 'College',
       'Specialization', 'Internal_Marks'],
      dtype='object')

In [54]:
df1.index

Index(['r1', 'r2', 'r3', 'r4'], dtype='object')

In [55]:
df1_num = df1.select_dtypes("number")
df1_num

    Percentage  Internal_Marks
r1          80            23.0
r2          90            28.0
r3          60             NaN
r4          75            18.0

In [56]:
df1_cat = df1.select_dtypes("object")
df1_cat

     Names Education    Address   Branch College Specialization
r1  Chirag        BE  Bangalore    Civil     xyz     structures
r2   Adesh     Mtech       Pune      CSE     xyz          cyber
r3  Mahesh       MSc    Chennai      ISE     xyz       database
r4  Rajesh     Btech     Mumbai  BIOTech     xyz             Ml

In [57]:
df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [58]:
print(df7)
print("------------")
print(df8)

  customer category important  sales
0      101     cat2       yes    123
1      102     cat2        no     52
2      103     cat1       yes    214
3      104     cat3       yes    663
------------
  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [59]:
pd.concat([df7,df8],axis= 1, sort = False)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [60]:
pd.concat([df7,df8],axis= 1, sort = True)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [61]:
pd.concat([df7,df8],axis= 0, sort = False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

In [62]:
pd.concat([df7,df8],axis= 0, sort = True)

  category   color customer  distance important  sales
0     cat2     NaN      101       NaN       yes    123
1     cat2     NaN      102       NaN        no     52
2     cat1     NaN      103       NaN       yes    214
3     cat3     NaN      104       NaN       yes    663
4      NaN  yellow      101      12.0       NaN    123
5      NaN   green      103       9.0       NaN    214
6      NaN   green      104      44.0       NaN    663
7      NaN    blue      105      21.0       NaN    331

# MERGE and JOIN

<img height=300 width=300 src="joins-venn.png" />

In [63]:
pd.merge(df7,df8, how ="outer", on="customer")

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow      12.0    123.0
1      102     cat2        no     52.0     NaN       NaN      NaN
2      103     cat1       yes    214.0   green       9.0    214.0
3      104     cat3       yes    663.0   green      44.0    663.0
4      105      NaN       NaN      NaN    blue      21.0    331.0

In [64]:
pd.merge(df7,df8, how ="inner", on="customer")

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow        12      123
1      103     cat1       yes      214   green         9      214
2      104     cat3       yes      663   green        44      663

In [65]:
pd.merge(df7,df8, how ="left", on="customer")

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes      123  yellow      12.0    123.0
1      102     cat2        no       52     NaN       NaN      NaN
2      103     cat1       yes      214   green       9.0    214.0
3      104     cat3       yes      663   green      44.0    663.0

In [66]:
pd.merge(df7,df8, how ="right", on="customer")

  customer category important  sales_x   color  distance  sales_y
0      101     cat2       yes    123.0  yellow        12      123
1      103     cat1       yes    214.0   green         9      214
2      104     cat3       yes    663.0   green        44      663
3      105      NaN       NaN      NaN    blue        21      331

# JOIN

In [67]:
# join behaves just like merge, 
# except instead of using the values of one of the columns 
# to combine data frames, it uses the index labels

In [68]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df10 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

print(df9)
print()
print(df10)

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [69]:
df9.join(df10, how = "outer")

       Q1     Q2     Q3     Q4
I0  101.0  201.0  301.0  401.0
I1  102.0  202.0    NaN    NaN
I2  103.0  203.0  302.0  402.0
I3    NaN    NaN  303.0  403.0

In [70]:
df9.join(df10, how="inner")

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I2  103  203  302  402

In [71]:
df9.join(df10, how = "left")

     Q1   Q2     Q3     Q4
I0  101  201  301.0  401.0
I1  102  202    NaN    NaN
I2  103  203  302.0  402.0

In [72]:
df9.join(df10, how = "right")

       Q1     Q2   Q3   Q4
I0  101.0  201.0  301  401
I2  103.0  203.0  302  402
I3    NaN    NaN  303  403

# Conditional Filtering

In [73]:
df1

,Names,Education,Address,Percentage,Branch,College,Specialization,Internal_Marks
r1,Chirag,BE,Bangalore,80,Civil,xyz,structures,23.0
r2,Adesh,Mtech,Pune,90,CSE,xyz,cyber,28.0
r3,Mahesh,MSc,Chennai,60,ISE,xyz,database,NaN
r4,Rajesh,Btech,Mumbai,75,BIOTech,xyz,Ml,18.0

In [74]:
#filtering functions 
#fetch students who have score above 70 percentage??---> query the dataframe 
#conditional statements

In [75]:
df1[df1.Percentage > 70]

,Names,Education,Address,Percentage,Branch,College,Specialization,Internal_Marks
r1,Chirag,BE,Bangalore,80,Civil,xyz,structures,23.0
r2,Adesh,Mtech,Pune,90,CSE,xyz,cyber,28.0
r4,Rajesh,Btech,Mumbai,75,BIOTech,xyz,Ml,18.0

In [76]:
#fetch student record having address bangalore and percentage greater than 70
# AND CONDITION : Both the condition must satisfy

In [79]:
df1[(df1.Address == "Bangalore") & (df1.Percentage > 70)]

,Names,Education,Address,Percentage,Branch,College,Specialization,Internal_Marks
r1,Chirag,BE,Bangalore,80,Civil,xyz,structures,23.0

In [80]:
df1[(df1.Address =="Bangalore") | (df1.Percentage >70)]

,Names,Education,Address,Percentage,Branch,College,Specialization,Internal_Marks
r1,Chirag,BE,Bangalore,80,Civil,xyz,structures,23.0
r2,Adesh,Mtech,Pune,90,CSE,xyz,cyber,28.0
r4,Rajesh,Btech,Mumbai,75,BIOTech,xyz,Ml,18.0

# GROUP BY

In [81]:
# aggregate function - # Must use an aggregate function
# avg, min, max, sum, count...etc

In [82]:
d1  =  {'items' : ['veg_burger', 'veg_burger', 'chicken_burger','chicken_burger', 'softy_icecream', 'softy_icecream'], 
       
       'sale' : [100, 200, 100, 250, 150, 50] , 'cities' : ['c1', 'c2', 'c1', 'c2', 'c1', 'c2']}

sales  =  pd.DataFrame(d1)
sales

            items  sale cities
0      veg_burger   100     c1
1      veg_burger   200     c2
2  chicken_burger   100     c1
3  chicken_burger   250     c2
4  softy_icecream   150     c1
5  softy_icecream    50     c2

In [83]:
sales.groupby(by ="items").mean()

C:\Users\Apoorva\AppData\Local\Temp\ipykernel_26952\4294252845.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  sales.groupby(by ="items").mean()

                 sale
items
chicken_burger  175.0
softy_icecream  100.0
veg_burger      150.0

In [84]:
sales.groupby(by ="items").count()

                sale  cities
items
chicken_burger     2       2
softy_icecream     2       2
veg_burger         2       2

In [85]:
sales.groupby(by = "items").max()

                sale cities
items
chicken_burger   250     c2
softy_icecream   150     c2
veg_burger       200     c2

In [86]:
sales.groupby(by = "items").min()

                sale cities
items
chicken_burger   100     c1
softy_icecream    50     c1
veg_burger       100     c1

In [88]:
sales.groupby(by = "items").describe()

                sale
               count   mean         std    min    25%    50%    75%    max
items
chicken_burger   2.0  175.0  106.066017  100.0  137.5  175.0  212.5  250.0
softy_icecream   2.0  100.0   70.710678   50.0   75.0  100.0  125.0  150.0
veg_burger       2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0

# pandas is mainly used to read the data and also access data from multiple or different sources

# CONVERT TO CSV

In [89]:
sales.to_csv("sales.csv", index = False)

In [91]:
data = pd.read_csv("sales.csv")
data

            items  sale cities
0      veg_burger   100     c1
1      veg_burger   200     c2
2  chicken_burger   100     c1
3  chicken_burger   250     c2
4  softy_icecream   150     c1
5  softy_icecream    50     c2

In [94]:
data.head()

            items  sale cities
0      veg_burger   100     c1
1      veg_burger   200     c2
2  chicken_burger   100     c1
3  chicken_burger   250     c2
4  softy_icecream   150     c1

In [95]:
data.tail()

            items  sale cities
1      veg_burger   200     c2
2  chicken_burger   100     c1
3  chicken_burger   250     c2
4  softy_icecream   150     c1
5  softy_icecream    50     c2

In [96]:
data.describe()

             sale
count    6.000000
mean   141.666667
std     73.598007
min     50.000000
25%    100.000000
50%    125.000000
75%    187.500000
max    250.000000

In [97]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   items   6 non-null      object
 1   sale    6 non-null      int64
 2   cities  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [98]:
data.isnull()

   items   sale  cities
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False

In [101]:
df1.isnull().sum() / len(df1) * 100

Names              0.0
Education          0.0
Address            0.0
Percentage         0.0
Branch             0.0
College            0.0
Specialization     0.0
Internal_Marks    25.0
dtype: float64

In [102]:
data["items"].unique()

array(['veg_burger', 'chicken_burger', 'softy_icecream'], dtype=object)

In [103]:
data["items"].count()

6

In [104]:
data["items"].value_counts()

veg_burger        2
chicken_burger    2
softy_icecream    2
Name: items, dtype: int64

In [105]:
data.shape

(6, 3)

In [106]:
data.columns

Index(['items', 'sale', 'cities'], dtype='object')

In [107]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [108]:
df1.index

Index(['r1', 'r2', 'r3', 'r4'], dtype='object')

In [110]:
data.sort_values("items")

            items  sale cities
2  chicken_burger   100     c1
3  chicken_burger   250     c2
4  softy_icecream   150     c1
5  softy_icecream    50     c2
0      veg_burger   100     c1
1      veg_burger   200     c2

In [111]:
data.sort_values("sale")

            items  sale cities
5  softy_icecream    50     c2
0      veg_burger   100     c1
2  chicken_burger   100     c1
4  softy_icecream   150     c1
1      veg_burger   200     c2
3  chicken_burger   250     c2

# DUPLICATE VALUES

In [113]:
data.duplicated().sum()

0

In [114]:
data.drop_duplicates()

            items  sale cities
0      veg_burger   100     c1
1      veg_burger   200     c2
2  chicken_burger   100     c1
3  chicken_burger   250     c2
4  softy_icecream   150     c1
5  softy_icecream    50     c2

# FOR MISSING VALUES _ WE ARE SUPPOSED TO CHECK HOW MUCH % OF DATA IS MISSING AND THE MISSING VALUE IN USUAL SHOUL NOT EXCEED MORE THAN 25-30%